In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [2]:
password = getpass()

········

In [8]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila' #WHY IS NOT HERE WORKIN @Ironhack instead??
engine = create_engine(connection_string)

In [9]:
type(engine)

sqlalchemy.engine.base.Engine

In [10]:
data = pd.read_sql_query('SELECT * FROM sakila.staff', engine) # Only works with SELECT statement
data

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,None,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

In [6]:
# option 1
data1 = pd.read_sql_query("SELECT * FROM bank.loan WHERE status IN ('A', 'B')", engine)
# option 2
result = engine.execute("SELECT * FROM bank.loan WHERE status IN ('A', 'B')")
print(type(result))
rows = [row for row in result]
data2 = pd.DataFrame(rows)

<class 'sqlalchemy.engine.cursor.LegacyCursorResult'>

In [21]:
# 1.How many distinct (different) actors' last names are there?
query1 = "SELECT COUNT(DISTINCT last_name) AS numbers_last_names_actors FROM sakila.actor"

print(query1)
data1 = pd.read_sql_query(query1, engine)

data1

SELECT COUNT(DISTINCT last_name) AS numbers_last_names_actors FROM sakila.actor

   numbers_last_names_actors
0                        121

In [19]:
# 2.Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

query2 = '''SELECT *,
CASE 
WHEN DAYOFWEEK(rental_date)= 1 OR DAYOFWEEK (rental_date) = 7 THEN "Weekend"  
ELSE "Weekday" 
END AS day_type 
FROM sakila.rental '''

data2 = pd.read_sql_query(query2, engine)
data2

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Weekday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Weekday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Weekday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Weekday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Weekday
...,...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53,Weekday
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53,Weekday
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53,Weekday
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53,Weekday
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53,Weekday

In [22]:
# 3.Get all films with ARMAGEDDON in the title.

data3 = pd.read_sql_query('SELECT title FROM film WHERE title LIKE "%%ARMAGEDDON%%"', engine)

display(data3) #either print(data3) works

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

In [25]:
# 4. Get 10 the longest films.

data4 = pd.read_sql_query("SELECT length, title FROM film ORDER BY length DESC LIMIT 10", engine)
data4

#the longest top 10 has 185 minutes. I displayed until that value change to provide value to the answer. 
#Maybe would be great having 10 different values to create the top 10.

   length               title
0     185      DARN FORRESTER
1     185        POND SEATTLE
2     185       CHICAGO NORTH
3     185       MUSCLE BRIGHT
4     185        WORST BANGER
5     185         GANGS PRIDE
6     185  SOLDIERS EVOLUTION
7     185           HOME PITY
8     185   SWEET BROTHERHOOD
9     185      CONTROL ANTHEM

In [27]:
# 5. How many films include Behind the Scenes content?

data5a = pd.read_sql_query("SELECT COUNT(special_features) FROM sakila.film WHERE special_features LIKE '%%Behind_the_Scenes%%'", engine)
#data5 = pd.read_sql_query("SELECT COUNT(*) FROM sakila.film WHERE special_features LIKE '%Behind_the_Scenes'",engine)
data5a

   COUNT(special_features)
0                      538

In [31]:
data5b = pd.read_sql_query("SELECT COUNT(DISTINCT special_features) AS Number_of_films_include_Behind_the_Scenes FROM sakila.film WHERE special_features LIKE '%%Behind_the_Scenes%%'",engine)
data5b

   Number_of_films_include_Behind_the_Scenes
0                                          8

In [32]:
# 6. Which kind of movies (rating) have a mean duration of more than two hours?

data6 = pd.read_sql_query("SELECT rating FROM film GROUP BY rating HAVING AVG(length) > 120",engine)

data6

  rating
0  PG-13

In [33]:
# 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

data7 = pd.read_sql_query("SELECT title, length FROM film WHERE length IS NOT NULL AND length > 0", engine)
data7

                 title  length
0     ACADEMY DINOSAUR      86
1       ACE GOLDFINGER      48
2     ADAPTATION HOLES      50
3     AFFAIR PREJUDICE     117
4          AFRICAN EGG     130
..                 ...     ...
995     YOUNG LANGUAGE     183
996         YOUTH KICK     179
997       ZHIVAGO CORE     105
998  ZOOLANDER FICTION     101
999          ZORRO ARK      50

[1000 rows x 2 columns]